export default [{
    'position': ['113.300236', '23.095743'],
    'address': '广东省广州市海珠区新港街道康乐路中山大学广州校区南校园',
    'name': '保管门客',
    'axis_label': '保管门客',
    'type': 8,
    'id': '6223599957'
}, {
    'position': ['113.357083', '23.157434'],
    'address': '广东省广州市天河区五山街道华南农业大学网球场华南农业大学',
    'name': '天河终端01',
    'axis_label': '天河终端01',
    'type': 8,
    'id': '6572926019'
}, {
    'position': ['113.322054', '23.131969'],
    'address': '天河城',
    'name': '天河传统渠道01',
    'axis_label': '天河传统渠道01',
    'type': 8,
    'id': '7721857855'
}]