export default [{
    'position': ['113.320243', '23.134959'],
    'address': '广东省广州市天河区悦新街7靠近VT101',
    'name': 'jnvb',
    'axis_label': 'jnvb',
    'type': 7
}, {
    'position': ['113.320255', '23.134928'],
    'address': '广东省广州市天河区悦新街7靠近VT101',
    'name': '某',
    'axis_label': '某',
    'type': 7
}, {
    'position': ['113.338560', '23.061303'],
    'address': '广东省广州市海珠区华洲街道华泰路广州海珠国家湿地公园',
    'name': '导测试门店68',
    'axis_label': '导测试门店68',
    'type': 7
}, {
    'position': ['113.369650', '23.100946'],
    'address': '广东省广州市海珠区琶洲街道琶洲大道东',
    'name': '导测试门店61',
    'axis_label': '导测试门店61',
    'type': 7
}, {
    'position': ['113.436186', '23.076394'],
    'address': '广东省广州市黄埔区长洲街道海虹路长洲岛',
    'name': '导测试门店74',
    'axis_label': '导测试门店74',
    'type': 7
}, {
    'position': ['113.369650', '23.100946'],
    'address': '广东省广州市海珠区琶洲街道琶洲大道东',
    'name': '导测试门店75',
    'axis_label': '导测试门店75',
    'type': 7
}, {
    'position': ['113.436186', '23.076394'],
    'address': '广东省广州市黄埔区长洲街道海虹路长洲岛',
    'name': '太和1',
    'axis_label': '太和1',
    'type': 7
}, {
    'position': ['113.345587', '22.985431'],
    'address': '广东省广州市番禺区南村镇里仁洞新村西一街里仁洞新村',
    'name': '太和3',
    'axis_label': '太和3',
    'type': 7
}, {
    'position': ['113.369650', '23.100946'],
    'address': '广东省广州市海珠区琶洲街道琶洲大道东',
    'name': '太和',
    'axis_label': '太和',
    'type': 7
}, {
    'position': ['113.300236', '23.095743'],
    'address': '广东省广州市海珠区新港街道康乐路中山大学广州校区南校园',
    'name': '保管门客',
    'axis_label': '保管门客',
    'type': 7
}, {
    'position': ['113.338560', '23.061303'],
    'address': '广东省广州市海珠区华洲街道华泰路广州海珠国家湿地公园',
    'name': '导测试门店82',
    'axis_label': '导测试门店82',
    'type': 7
}, {
    'position': ['113.338560', '23.061303'],
    'address': '广东省广州市海珠区华洲街道华泰路广州海珠国家湿地公园',
    'name': '导测试门店54',
    'axis_label': '导测试门店54',
    'type': 7
}, {
    'position': ['113.436186', '23.076394'],
    'address': '广东省广州市黄埔区长洲街道海虹路长洲岛',
    'name': '导测试门店4',
    'axis_label': '导测试门店4',
    'type': 7
}, {
    'position': ['113.338560', '23.061303'],
    'address': '广东省广州市海珠区华洲街道华泰路广州海珠国家湿地公园',
    'name': '导测试门店12',
    'axis_label': '导测试门店12',
    'type': 7
}, {
    'position': ['113.369650', '23.100946'],
    'address': '广东省广州市海珠区琶洲街道琶洲大道东',
    'name': '导测试门店5',
    'axis_label': '导测试门店5',
    'type': 7
}, {
    'position': ['113.32033', '23.134918'],
    'address': '广东省广州市天河区悦新街103-1号靠近VT101',
    'name': '墨子',
    'axis_label': '墨子',
    'type': 7
}, {
    'position': ['113.345587', '22.985431'],
    'address': '广东省广州市番禺区南村镇里仁洞新村西一街里仁洞新村',
    'name': 'TR导测试门店3',
    'axis_label': 'TR导测试门店3',
    'type': 7
}, {
    'position': ['113.436186', '23.076394'],
    'address': '广东省广州市黄埔区长洲街道海虹路长洲岛',
    'name': 'TR导测试门店4',
    'axis_label': 'TR导测试门店4',
    'type': 7
}, {
    'position': ['113.338560', '23.061303'],
    'address': '广东省广州市海珠区华洲街道华泰路广州海珠国家湿地公园',
    'name': '导测试门店26',
    'axis_label': '导测试门店26',
    'type': 7
}, {
    'position': ['113.369650', '23.100946'],
    'address': '广东省广州市海珠区琶洲街道琶洲大道东',
    'name': '导测试门店19',
    'axis_label': '导测试门店19',
    'type': 7
}, {
    'position': ['113.369650', '23.100946'],
    'address': '广东省广州市海珠区琶洲街道琶洲大道东',
    'name': 'TR导测试门店5',
    'axis_label': 'TR导测试门店5',
    'type': 7
}, {
    'position': ['113.436186', '23.076394'],
    'address': '广东省广州市黄埔区长洲街道海虹路长洲岛',
    'name': '导测试门店32',
    'axis_label': '导测试门店32',
    'type': 7
}, {
    'position': ['113.338560', '23.061303'],
    'address': '广东省广州市海珠区华洲街道华泰路广州海珠国家湿地公园',
    'name': '导测试门店40',
    'axis_label': '导测试门店40',
    'type': 7
}, {
    'position': ['113.369650', '23.100946'],
    'address': '广东省广州市海珠区琶洲街道琶洲大道东',
    'name': '导测试门店47',
    'axis_label': '导测试门店47',
    'type': 7
}, {
    'position': ['113.345587', '22.985431'],
    'address': '广东省广州市番禺区南村镇里仁洞新村西一街里仁洞新村',
    'name': '导测试门店59',
    'axis_label': '导测试门店59',
    'type': 7
}, {
    'position': ['113.345587', '22.985431'],
    'address': '广东省广州市番禺区南村镇里仁洞新村西一街里仁洞新村',
    'name': '导测试门店3',
    'axis_label': '导测试门店3',
    'type': 7
}, {
    'position': ['113.345587', '22.985431'],
    'address': '广东省广州市番禺区南村镇里仁洞新村西一街里仁洞新村',
    'name': '导测试门店17',
    'axis_label': '导测试门店17',
    'type': 7
}, {
    'position': ['113.436186', '23.076394'],
    'address': '广东省广州市黄埔区长洲街道海虹路长洲岛',
    'name': '导测试门店18',
    'axis_label': '导测试门店18',
    'type': 7
}, {
    'position': ['113.345587', '22.985431'],
    'address': '广东省广州市番禺区南村镇里仁洞新村西一街里仁洞新村',
    'name': '导测试门店31',
    'axis_label': '导测试门店31',
    'type': 7
}, {
    'position': ['113.369650', '23.100946'],
    'address': '广东省广州市海珠区琶洲街道琶洲大道东',
    'name': '导测试门店33',
    'axis_label': '导测试门店33',
    'type': 7
}, {
    'position': ['113.345587', '22.985431'],
    'address': '广东省广州市番禺区南村镇里仁洞新村西一街里仁洞新村',
    'name': '导测试门店45',
    'axis_label': '导测试门店45',
    'type': 7
}, {
    'position': ['113.436186', '23.076394'],
    'address': '广东省广州市黄埔区长洲街道海虹路长洲岛',
    'name': '导测试门店60',
    'axis_label': '导测试门店60',
    'type': 7
}, {
    'position': ['113.345587', '22.985431'],
    'address': '广东省广州市番禺区南村镇里仁洞新村西一街里仁洞新村',
    'name': '导测试门店73',
    'axis_label': '导测试门店73',
    'type': 7
}, {
    'position': ['113.345587', '22.985431'],
    'address': '广东省广州市番禺区南村镇里仁洞新村西一街里仁洞新村',
    'name': 'TR导测试门店17',
    'axis_label': 'TR导测试门店17',
    'type': 7
}, {
    'position': ['113.32047', '23.134806'],
    'address': '广东省广州市天河区悦新街103-1号靠近VT101',
    'name': 'hhhkk',
    'axis_label': 'hhhkk',
    'type': 7
}, {
    'position': ['113.436186', '23.076394'],
    'address': '广东省广州市黄埔区长洲街道海虹路长洲岛',
    'name': 'TR导测试门店18',
    'axis_label': 'TR导测试门店18',
    'type': 7
}, {
    'position': ['113.369650', '23.100946'],
    'address': '广东省广州市海珠区琶洲街道琶洲大道东',
    'name': 'TR导测试门店19',
    'axis_label': 'TR导测试门店19',
    'type': 7
}, {
    'position': ['113.345587', '22.985431'],
    'address': '广东省广州市番禺区南村镇里仁洞新村西一街里仁洞新村',
    'name': 'TR导测试门店31',
    'axis_label': 'TR导测试门店31',
    'type': 7
}, {
    'position': ['113.436186', '23.076394'],
    'address': '广东省广州市黄埔区长洲街道海虹路长洲岛',
    'name': 'TR导测试门店32',
    'axis_label': 'TR导测试门店32',
    'type': 7
}, {
    'position': ['113.369650', '23.100946'],
    'address': '广东省广州市海珠区琶洲街道琶洲大道东',
    'name': 'TR导测试门店33',
    'axis_label': 'TR导测试门店33',
    'type': 7
}, {
    'position': ['113.345587', '22.985431'],
    'address': '广东省广州市番禺区南村镇里仁洞新村西一街里仁洞新村',
    'name': 'TR导测试门店45',
    'axis_label': 'TR导测试门店45',
    'type': 7
}, {
    'position': ['113.436186', '23.076394'],
    'address': '广东省广州市黄埔区长洲街道海虹路长洲岛',
    'name': 'TR导测试门店46',
    'axis_label': 'TR导测试门店46',
    'type': 7
}, {
    'position': ['113.369650', '23.100946'],
    'address': '广东省广州市海珠区琶洲街道琶洲大道东',
    'name': 'TR导测试门店47',
    'axis_label': 'TR导测试门店47',
    'type': 7
}, {
    'position': ['113.345587', '22.985431'],
    'address': '广东省广州市番禺区南村镇里仁洞新村西一街里仁洞新村',
    'name': 'TR导测试门店59',
    'axis_label': 'TR导测试门店59',
    'type': 7
}, {
    'position': ['113.436186', '23.076394'],
    'address': '广东省广州市黄埔区长洲街道海虹路长洲岛',
    'name': 'TR导测试门店60',
    'axis_label': 'TR导测试门店60',
    'type': 7
}, {
    'position': ['113.369650', '23.100946'],
    'address': '广东省广州市海珠区琶洲街道琶洲大道东',
    'name': 'TR导测试门店61',
    'axis_label': 'TR导测试门店61',
    'type': 7
}, {
    'position': ['113.345587', '22.985431'],
    'address': '广东省广州市番禺区南村镇里仁洞新村西一街里仁洞新村',
    'name': 'TR导测试门店73',
    'axis_label': 'TR导测试门店73',
    'type': 7
}, {
    'position': ['113.436186', '23.076394'],
    'address': '广东省广州市黄埔区长洲街道海虹路长洲岛',
    'name': 'TR导测试门店74',
    'axis_label': 'TR导测试门店74',
    'type': 7
}, {
    'position': ['113.369650', '23.100946'],
    'address': '广东省广州市海珠区琶洲街道琶洲大道东',
    'name': 'TR导测试门店75',
    'axis_label': 'TR导测试门店75',
    'type': 7
}]