/*
 * 模拟轨迹分析-被动定位相关数据
 * 移动 - 不在线 - 停留 - 移动
*/

export default {
    'xxx_status': [
        {
            'stateid': '', // 状态分析id
            'memberid': '', // 成员id
            'status': '2', // 1 不在线 2 移动 3 停留 4 异常
            'battery': '50%', // 电量 状态， 结束点时点电量
            'starttime': '1590451550000', // 开始时间
            'endtime': '1590458150000', // 结束时间
            'reason': 'test', // 原因？// 定位失败原因？定位失败提示语
            'events': [
                {
                    'xxid': '12312',
                    'time': '',
                    'event': ''
                }
            ], // 停留时，事件信息， // 一段json字符串数据
            'points': [ // 字符串数组json
                // 1. 不在线：用于记录开始点、结束点，有可能开始点和结束点为同一个数据
                // 2. 移动： 用于画轨迹线
                // 3. 定位失败时：与不在线处理一样
                // 4. 停留时，值记录这段时间中，定位点中的某一个点作为中心，停留时，只有一个数据点
                {
                    'xxid': 'id1',
                    'time': '1590452150000',
                    'latlng': '{"address":"重庆市渝北区双凤桥街道长东路36号2幢/2至1夹/1铺位号C区一层248#","latitude":"32.356938","longitude":"119.942101"}',
                    'lat': '32.356938',
                    'lng': '119.942101',
                    'address': '重庆市渝北区双凤桥街道长东路36号2幢/2至1夹/1铺位号C区一层248#'
                },
                {
                    'xxid': 'id2',
                    'time': '1590452750000',
                    'latlng': '{"address":"重庆市渝北区回兴街道金梭大道56号（2号仓库）","latitude":"29.676074","longitude":"106.627207"}',
                    'lat': '29.676074',
                    'lng': '106.627207',
                    'address': '重庆市渝北区回兴街道金梭大道56号（2号仓库）'
                },
                {
                    'xxid': 'id3',
                    'time': '1590453350000',
                    'latlng': '{"address":"重庆市渝北区康城路蓝色星空-1期附近","latitude":"29.675204","longitude":"106.607348"}',
                    'lat': '29.675204',
                    'lng': '106.607348',
                    'address': '重庆市渝北区康城路蓝色星空-1期附近'
                },
                {
                    'xxid': 'id4',
                    'time': '1590456950000',
                    'latlng': '{"address":"重庆市九龙坡区科园四路101号中国建设银行(杨家坪支行科园四路分理处)附近","latitude":"29.532633","longitude":"106.494723"}',
                    'lat': '29.532633',
                    'lng': '106.494723',
                    'address': '庆市九龙坡区科园四路101号中国建设银行(杨家坪支行科园四路分理处)附近'
                },
                {
                    'xxid': 'id5',
                    'time': '1590458150000',
                    'latlng': '{"address":"重庆市渝北区宝圣大道567-、569号","latitude":"29.669871","longitude":"106.597592"}',
                    'lat': '29.669871',
                    'lng': '106.597592',
                    'address': '重庆市渝北区宝圣大道567-、569号'
                }
            ] // 状态分析id
        },
        {
            'stateid': '', // 状态分析id
            'memberid': '', // 成员id
            'status': '1', // 1 不在线 2 移动 3 停留 4 异常
            'battery': '20%', // 电量 状态， 结束点时点电量
            'starttime': '1590458150000', // 开始时间
            'endtime': '1590459410000', // 结束时间
            'reason': 'test', // 原因？// 定位失败原因？定位失败提示语
            'events': [
                {
                    'xxid': '12312',
                    'time': '',
                    'event': ''
                }
            ], // 停留时，事件信息， // 一段json字符串数据
            'points': [ // 字符串数组json
                // 1. 不在线：用于记录开始点、结束点，有可能开始点和结束点为同一个数据
                // 2. 移动： 用于画轨迹线
                // 3. 定位失败时：与不在线处理一样
                // 4. 停留时，值记录这段时间中，定位点中的某一个点作为中心，停留时，只有一个数据点
                {
                    'xxid': 'id6',
                    'time': '1590458150000',
                    'latlng': '{"address":"重庆市江北区建新东路79号-附2号重庆市农村商业银行(万丰分理处)附近","latitude":"29.578326","longitude":"119.942101"',
                    'lat': '29.578326',
                    'lng': '106.557215',
                    'address': '重庆市江北区建新东路79号-附2号重庆市农村商业银行(万丰分理处)附近'
                },
                {
                    'xxid': 'id6',
                    'time': '1590459410000',
                    'latlng': '{"address":"重庆市江北区建新东路295号永辉超市(五里店)附近","latitude":"29.579732","longitude":"106.557725"}',
                    'lat': '29.579732',
                    'lng': '106.557725',
                    'address': '重庆市江北区建新东路295号永辉超市(五里店)附近'
                }
            ] // 状态分析id
        },
        {
            'stateid': '', // 状态分析id
            'memberid': '', // 成员id
            'status': '4', // 1 不在线 2 移动 3 停留 4 异常
            'battery': '30%', // 电量 状态， 结束点时点电量
            'starttime': '1590459410000', // 开始时间
            'endtime': '1590460610000', // 结束时间
            'reason': 'test', // 原因？// 定位失败原因？定位失败提示语
            'events': [
                {
                    'xxid': '12312',
                    'time': '',
                    'event': ''
                }
            ], // 停留时，事件信息， // 一段json字符串数据
            'points': [ // 字符串数组json
                // 1. 不在线：用于记录开始点、结束点，有可能开始点和结束点为同一个数据
                // 2. 移动： 用于画轨迹线
                // 3. 定位失败时：与不在线处理一样
                // 4. 停留时，值记录这段时间中，定位点中的某一个点作为中心，停留时，只有一个数据点
                {
                    'xxid': '123123',
                    'time': '1590459410000',
                    'latlng': '{"address":"重庆市江北区盘溪五支路永辉城市生活广场附近","latitude":"29.589605","longitude":"106.480124"}',
                    'lat': '29.589605',
                    'lng': '106.480124',
                    'address': '重庆市江北区盘溪五支路永辉城市生活广场附近'
                },
                {
                    'xxid': '123123',
                    'time': '1590460610000',
                    'latlng': '{"address":"重庆市江北区盘溪五支路永辉城市生活广场附近","latitude":"29.589605","longitude":"106.480124"}',
                    'lat': '29.589605',
                    'lng': '106.480124',
                    'address': '重庆市江北区盘溪五支路永辉城市生活广场附近'
                }
            ] // 状态分析id
        },
        {
            'stateid': '', // 状态分析id
            'memberid': '', // 成员id
            'status': '3', // 1 不在线 2 移动 3 停留 4 异常
            'battery': '99%', // 电量 状态， 结束点时点电量
            'starttime': '1590460610000', // 开始时间
            'endtime': '1590464210000', // 结束时间
            'reason': 'test', // 原因？// 定位失败原因？定位失败提示语
            'events': [
                {
                    'xxid': '12312',
                    'time': '',
                    'event': ''
                }
            ], // 停留时，事件信息， // 一段json字符串数据
            'points': [ // 字符串数组json
                // 1. 不在线：用于记录开始点、结束点，有可能开始点和结束点为同一个数据
                // 2. 移动： 用于画轨迹线
                // 3. 定位失败时：与不在线处理一样
                // 4. 停留时，值记录这段时间中，定位点中的某一个点作为中心，停留时，只有一个数据点
                {
                    'xxid': '123123',
                    'time': '1590460610000',
                    'latlng': '{"address":"重庆市沙坪坝区三峡广场步行街11号靠近沙坪坝区文化馆","latitude":"29.557880","longitude":"106.462141"}',
                    'lat': '29.557880',
                    'lng': '106.462141',
                    'address': '重庆市沙坪坝区三峡广场步行街11号靠近沙坪坝区文化馆'
                }
            ] // 状态分析id
        },
        {
            'stateid': '', // 状态分析id
            'memberid': '', // 成员id
            'status': '2', // 1 不在线 2 移动 3 停留 4 异常
            'battery': '50%', // 电量 状态， 结束点时点电量
            'starttime': '1590464210000', // 开始时间
            'endtime': '1590475010000', // 结束时间
            'reason': 'test', // 原因？// 定位失败原因？定位失败提示语
            'events': [
                {
                    'xxid': '12312',
                    'time': '',
                    'event': ''
                }
            ], // 停留时，事件信息， // 一段json字符串数据
            'points': [ // 字符串数组json
                // 1. 不在线：用于记录开始点、结束点，有可能开始点和结束点为同一个数据
                // 2. 移动： 用于画轨迹线
                // 3. 定位失败时：与不在线处理一样
                // 4. 停留时，值记录这段时间中，定位点中的某一个点作为中心，停留时，只有一个数据点
                {
                    'xxid': '123123',
                    'time': '1590464210000',
                    'latlng': '{"address":"重庆市渝北区双凤桥街道长东路36号2幢/2至1夹/1铺位号C区一层248#","latitude":"29.743966","longitude":"106.644547"}',
                    'lat': '29.743966',
                    'lng': '106.644547',
                    'address': '重庆市渝北区双凤桥街道长东路36号2幢/2至1夹/1铺位号C区一层248#'
                },
                {
                    'xxid': '123123',
                    'time': '1590467810000',
                    'latlng': '{"address":"重庆市渝北区回兴街道金梭大道56号（2号仓库）","latitude":"29.676074","longitude":"106.627207"}',
                    'lat': '29.676074',
                    'lng': '106.627207',
                    'address': '重庆市渝北区回兴街道金梭大道56号（2号仓库）'
                },
                {
                    'xxid': '123123',
                    'time': '1590475010000',
                    'latlng': '{"address":"重庆市渝北区康城路蓝色星空-1期附近","latitude":"29.675204","longitude":"106.607348"}',
                    'lat': '29.675204',
                    'lng': '106.607348',
                    'address': '重庆市渝北区康城路蓝色星空-1期附近'
                }
            ] // 状态分析id
        }
    ]
}
