/*
 * 模拟轨迹分析-被动定位相关数据
 * 移动 - 不在线 - 停留 - 移动
 * points: 字符串数组json
 * 1. 不在线：用于记录开始点、结束点，有可能开始点和结束点为同一个数据
 * 2. 移动： 用于画轨迹线
 * 3. 定位失败时：与不在线处理一样
 * 4. 停留时，值记录这段时间中，定位点中的某一个点作为中心，停留时，只有一个数据点
 * 5. 成功定位时只有一个数据点
 * events: 字符串数组json
*/

export default {
    'pl_track_status': [
        {
            'stateid': '', // 状态分析id
            'memberid': '', // 成员id
            'status': '2', // 1 不在线 2 移动 3 停留 4 异常
            'battery': '50%', // 电量 状态， 结束点时点电量
            'starttime': '1590336000000', // 开始时间
            'endtime': '1590390607000', // 结束时间
            'reason': 'test', // 原因？// 定位失败原因？定位失败提示语
            'events': [
                {
                    'xxid': '12312',
                    'time': '',
                    'event': ''
                }
            ], // 停留时，事件信息， // 一段json字符串数据
            'points': [
                {
                    'pointid': 'id1',
                    'collecttime': '1590452150000',
                    'lat': '23.149818',
                    'lng': '113.3213',
                    'address': '广东省广州市天河区林和街道广州大道北472'
                },
                {
                    'pointid': 'id2',
                    'collecttime': '1590452750000',
                    'lat': '23.130227',
                    'lng': '113.327866',
                    'address': '广东省广州市天河区天河南街道天盛大厦天盛大厦(六运三街)'
                },
                {
                    'pointid': 'id3',
                    'collecttime': '1590453350000',
                    'lat': '23.130957',
                    'lng': '113.31835',
                    'address': '广东省广州市天河区天河南街道天河村'
                },
                {
                    'pointid': 'id4',
                    'collecttime': '1590456950000',
                    'lat': '23.131216',
                    'lng': '113.323049',
                    'address': '广东省广州市天河区天河南街道天河南一路13天河城'
                },
                {
                    'pointid': 'id5',
                    'collecttime': '1590458150000',
                    'lat': '23.143677',
                    'lng': '113.333832',
                    'address': '广东省广州市天河区石牌街道天润路399祥兴大厦'
                }
            ] // 状态分析id
        }
    ]
}
